In [1]:
pip install pandas

Requirement already satisfied: pandas in g:\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in g:\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\shiwa\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in g:\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in g:\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\shiwa\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [4]:
# Pandas Series
a = [1, 7, 2]

myvar = pd.Series(a)

print(myvar)

0    1
1    7
2    2
dtype: int64

In [5]:
data ={'A':[1,2,np.nan,4],'B':[1,2,np.nan,4]}
# df=pd

NameError: name 'np' is not defined

In [ ]:
df=pd.DataFrame({'Name':['A','B','C','D'],'Age':[15,20,30,40],'Rollno':[1,2,3,4],'Salary':[45,56,60,65]})
filter_df=df[df['Age']>30] # Data Filtiring

print(filter_df) 

filter_df=df.query("Age>30 and Salary <80000") #Quering
print(filter_df)

  Name  Age  Rollno  Salary
3    D   40       4      65
  Name  Age  Rollno  Salary
3    D   40       4      65

In [ ]:
df

  Name  Age  Rollno  Salary
0    A   15       1      45
1    B   20       2      56
2    C   30       3      60
3    D   40       4      65

In [ ]:
df['Phone']=[123456,123456,123456,123456]

In [ ]:
df

  Name  Age  Rollno  Salary   Phone
0    A   15       1      45  123456
1    B   20       2      56  123456
2    C   30       3      60  123456
3    D   40       4      65  123456

In [ ]:
df['Phone']=123456
df

  Name  Age  Rollno  Salary   Phone
0    A   15       1      45  123456
1    B   20       2      56  123456
2    C   30       3      60  123456
3    D   40       4      65  123456

In [ ]:
df=df.drop(columns=['Phone'])
df

  Name  Age  Rollno  Salary
0    A   15       1      45
1    B   20       2      56
2    C   30       3      60
3    D   40       4      65

In [ ]:
df.insert(2,'Phone',1234567)
df

  Name  Age    Phone  Rollno  Salary
0    A   15  1234567       1      45
1    B   20  1234567       2      56
2    C   30  1234567       3      60
3    D   40  1234567       4      65

In [ ]:
df.rename(columns={'Rollno':'Grade'}) #rename

  Name  Age    Phone  Grade  Salary
0    A   15  1234567      1      45
1    B   20  1234567      2      56
2    C   30  1234567      3      60
3    D   40  1234567      4      65

In [ ]:
df

  Name  Age  Rollno  Salary
0    A   15       1      45
1    B   20       2      56
2    C   30       3      60
3    D   40       4      65

In [ ]:
df.drop(3)

  Name  Age  Rollno  Salary
0    A   15       1      45
1    B   20       2      56
2    C   30       3      60

In [ ]:
pd.DataFrame(df, columns=['Name','Age','Rollno','Salary'])

  Name  Age  Rollno  Salary
0    A   15       1      45
1    B   20       2      56
2    C   30       3      60
3    D   40       4      65

In [ ]:
#

In [ ]:
df.loc[0,'Salary']=500
df

  Name  Age  Rollno  Salary   Phone
0    A   15       1     500  123456
1    B   20       2      56  123456
2    C   30       3      60  123456
3    D   40       4      65  123456

In [ ]:
df.drop(3)

  Name  Age  Rollno  Salary   Phone
0    A   15       1     500  123456
1    B   20       2      56  123456
2    C   30       3      60  123456

In [ ]:
# df.loc[len(df)]=['D',34,5,56]

In [ ]:
# Update 
df.loc[[0,1],'Salary']=[600,700]
df

  Name  Age  Rollno  Salary   Phone
0    A   15       1     600  123456
1    B   20       2     700  123456
2    C   30       3      60  123456
3    D   40       4      65  123456

In [ ]:
#Group By
group_df=df.groupby('Name')['Salary'].mean()
group_df

Name
A    600.0
B    700.0
C     60.0
D     65.0
Name: Salary, dtype: float64

In [ ]:
# Merging and dataFrame
df1=pd.DataFrame({'ID':[1,2,3],'Name':['Alice','Bob','Charlie']})
df2=pd.DataFrame({'ID':[1,2,4],'Salary':[50000,60000,70000]})

In [ ]:
merged_df=pd.merge(df1,df2,on='ID',how='inner')

In [ ]:
merged_df

   ID   Name  Salary
0   1  Alice   50000
1   2    Bob   60000

In [ ]:
print(df1['ID'].unique())

[1 2 3]

In [ ]:
print(df2['ID'].unique())

[1 2 4]

In [ ]:
df1=df1['ID'].astype(int)

In [ ]:
df1

0    1
1    2
2    3
Name: ID, dtype: int64

In [ ]:
'''1. Create a DataFrame with columns 'Name', 'Age', 'City', 'Salary' and select only the 'Name' and 'Salary' columns.
2. From the given DataFrame, find all employees who earn more than 60,000.
3. Create a new column 'Experience' that contains years of experience as [2, 5, 7, 10].
4. Sort the DataFrame by Salary in descending order.
5. Find the average salary of employees in each city.
6. Fill missing values in a DataFrame with the column mean.
7. You have two DataFrames:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']}) 
df2 = pd.DataFrame({'ID': [1, 2, 4], 'Salary': [50000, 60000, 70000]}) 
Merge them on the 'ID' column.
8. Create a pivot table showing the sum of salaries by city and experience level.
9. Create a new column 'Salary_After_Tax' where tax is 20% of the salary'''

In [ ]:
#1. Create a dataframe with column 'Name','Age','City','Salary' and select only the 'Name' and 'Slary' columns
mydataset = {
  'Name': ["Rohit", "Shiwam", "Abhishek"],
  'Age': [20, 20, 20],
  'City': ["patiyala", "mohali", "chandigrd"],
  'Salary':[60000, 70000, 200000]
}

df = pd.DataFrame(mydataset)

print(df)

       Name  Age       City  Salary
0     Rohit   20   patiyala   60000
1    Shiwam   20     mohali   70000
2  Abhishek   20  chandigrd  200000

In [ ]:
selected_columns = df[['Name', 'Salary']]
print(selected_columns)

       Name  Salary
0     Rohit   60000
1    Shiwam   70000
2  Abhishek  200000

In [ ]:
# 2. From the given DataFrame, find all employees who earn more than 60,000.
filter_df=df[df['Salary']>60000] # Data Filtiring
print(filter_df)

       Name  Age       City  Salary
1    Shiwam   20     mohali   70000
2  Abhishek   20  chandigrd  200000

In [ ]:
# 3. Create a new column 'Experience' that contains years of experience as [2, 5, 7, 10].
df['Experience'] = [2, 5, 7]
df

       Name  Age       City  Salary  Experience
0     Rohit   20   patiyala   60000           2
1    Shiwam   20     mohali   70000           5
2  Abhishek   20  chandigrd  200000           7

In [ ]:
# 4. Sort the DataFrame by Salary in descending order.
df_sorted = df.sort_values(by='Salary', ascending=False)
df_sorted

       Name  Age       City  Salary  Experience
2  Abhishek   20  chandigrd  200000           7
1    Shiwam   20     mohali   70000           5
0     Rohit   20   patiyala   60000           2

In [ ]:
# 5. Find the average salary of employees in each city.
avg_salary=df.groupby('Name')['Salary'].mean()
avg_salary

Name
Abhishek    200000.0
Rohit        60000.0
Shiwam       70000.0
Name: Salary, dtype: float64

In [ ]:
# 6. Fill missing values in a DataFrame with the column mean.
df_filled=df.fillna(df.mean(numeric_only=True), inplace=True)
df_filled

In [ ]:
# 8. Create a pivot table showing the sum of salaries by city and experience level.
pivot_table = df.pivot_table(values='Salary', index='City', columns='Experience', aggfunc='sum', fill_value=0)
pivot_table

Experience      2      5       7
City
chandigrd       0      0  200000
mohali          0  70000       0
patiyala    60000      0       0

In [ ]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [50000, 60000, 70000, 80000]
}

df = pd.DataFrame(data)

# Calculate Salary After Tax (20% deduction)
# df['Salary_After_Tax'] = df['Salary'] * 0.8  
df['Salary_After_Tax']=df['Salary'].apply(lambda x:x *0.8)

print(df)

      Name  Age         City  Salary  Salary_After_Tax
0    Alice   25     New York   50000           40000.0
1      Bob   30  Los Angeles   60000           48000.0
2  Charlie   35      Chicago   70000           56000.0
3    David   40      Houston   80000           64000.0

In [ ]:
# 7. You have two DataFrames:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']}) 
df2 = pd.DataFrame({'ID': [1, 2, 4], 'Salary': [50000, 60000, 70000]}) 
# Merge them on the 'ID' column.

In [ ]:
merged_df=pd.merge(df1,df2,on='ID',how='inner')
merged_df

   ID   Name  Salary
0   1  Alice   50000
1   2    Bob   60000

In [ ]:
date_rng=pd.date_range(start='2023-01-01',periods=5,freq='D')

In [ ]:
df=pd.DataFrame({'Date':date_rng,'Days':['Sun','Mon','Tue','Ths','Fri']}) 
df.set_index('Date',inplace=True)
df

           Days
Date
2023-01-01  Sun
2023-01-02  Mon
2023-01-03  Tue
2023-01-04  Ths
2023-01-05  Fri

In [ ]:
#Resampling data
df_Resampling=df.resample('2D').sum()
df_Resampling

              Days
Date
2023-01-01  SunMon
2023-01-03  TueThs
2023-01-05     Fri

In [ ]:
df['Value'] = [10, 20, 30,40,50]
df

           Days  Value
Date
2023-01-01  Sun     10
2023-01-02  Mon     20
2023-01-03  Tue     30
2023-01-04  Ths     40
2023-01-05  Fri     50

In [ ]:
#Performance optimization
df['new_col']=df['Value'].apply(lambda x:x **2)
df

           Days  Value  new_col
Date
2023-01-01  Sun     10      100
2023-01-02  Mon     20      400
2023-01-03  Tue     30      900
2023-01-04  Ths     40     1600
2023-01-05  Fri     50     2500

In [ ]:
df['Value']=df['Value'].astype('float32')

df

           Days  Value  new_col
Date
2023-01-01  Sun   10.0      100
2023-01-02  Mon   20.0      400
2023-01-03  Tue   30.0      900
2023-01-04  Ths   40.0     1600
2023-01-05  Fri   50.0     2500

In [ ]:
# df['Date']=pd.to_datetime(df['Date'])
df

           Days  Value  new_col
Date
2023-01-01  Sun   10.0      100
2023-01-02  Mon   20.0      400
2023-01-03  Tue   30.0      900
2023-01-04  Ths   40.0     1600
2023-01-05  Fri   50.0     2500

In [ ]:
#1. You have a DataFrame with missing values. Fill numeric columns with the mean and categorical columns with the mode.

# df = pd.DataFrame({

#     'Name': ['Alice', 'Bob', np.nan, 'David', 'Eve'],
#     'Age': [25, np.nan, 35, 40, 29],
#     'City': ['New York', 'Los Angeles', 'Chicago', np.nan, 'Houston'],
#     'Salary': [50000, 60000, 70000, 80000, np.nan]
# })

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', np.nan, 'David', 'Eve'],
    'Age': [25, np.nan, 35, 40, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', np.nan, 'Houston'],
    'Salary': [50000, 60000, 70000, 80000, np.nan]
})

In [ ]:
df

    Name    Age         City   Salary
0  Alice  25.00     New York  50000.0
1    Bob  32.25  Los Angeles  60000.0
2  Alice  35.00      Chicago  70000.0
3  David  40.00      Chicago  80000.0
4    Eve  29.00      Houston  65000.0

In [ ]:
# Fill numeric columns with mean
# df_filled=df.fillna(df.mean(numeric_only=True), inplace=True)
df['Age'].fillna(df['Age'].mean(), inplace=True)
df['Salary'].fillna(df['Salary'].mean(), inplace=True)
df

C:\Users\shiwa\AppData\Local\Temp\ipykernel_5232\1377226002.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)
C:\Users\shiwa\AppData\Local\Temp\ipykernel_5232\1377226002.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(), inplace=True)

    Name    Age         City   Salary
0  Alice  25.00     New York  50000.0
1    Bob  32.25  Los Angeles  60000.0
2    NaN  35.00      Chicago  70000.0
3  David  40.00          NaN  80000.0
4    Eve  29.00      Houston  65000.0

In [ ]:
# Fill categorical columns with mode
df['Name'].fillna(df['Name'].mode()[0], inplace=True)
df['City'].fillna(df['City'].mode()[0], inplace=True)

print(df)

    Name   Age         City   Salary
0  Alice  25.0     New York  50000.0
1    Bob   NaN  Los Angeles  60000.0
2  Alice  35.0      Chicago  70000.0
3  David  40.0      Chicago  80000.0
4    Eve  29.0      Houston      NaN

C:\Users\shiwa\AppData\Local\Temp\ipykernel_5232\2577745684.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Name'].fillna(df['Name'].mode()[0], inplace=True)
C:\Users\shiwa\AppData\Local\Temp\ipykernel_5232\2577745684.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['City'].fillna(df['City'].mode()[0], inplace=True)

In [ ]:
# 2. Create a multi-index DataFrame and select all rows where the first index is 'A'. 
# arrays = [['A', 'A', 'B', 'B'], [1, 2, 1, 2]]
import pandas as pd

arrays = [['A', 'A', 'B', 'B'], [1, 2, 1, 2]]
index = pd.MultiIndex.from_arrays(arrays, names=['Letter', 'Number'])

df = pd.DataFrame({'Value': [10, 20, 30, 40]}, index=index)

filtered_df = df.loc['A']

print(filtered_df)

        Value
Number
1          10
2          20

In [ ]:
'''

3. Create a pivot table to show both the sum and mean of salaries by city.
4. Create a new column 'Category' based on the salary:
Low if Salary < 60,000
Medium if Salary is between 60,000 and 80,000
High if Salary > 80,000

5. Group by 'City' and calculate the mean Age and sum of Salaries.
6. Assign a rank to employees based on their salary within each city.'''